Tekla Open API Reference for Tekla Structures 2025
NoAttributes Constructor
Overload List
Name | Description
DrawingObject.NoAttributes()
 Creates a new default no attributes instance.
DrawingObject.NoAttributes(String)
 Creates a new no attributes instance. No attributes are loaded from the attribute file as it is not possible to load attributes for objects of this type.
Top
See Also
Reference
DrawingObject.NoAttributes Class
Tekla.Structures.Drawing Namespace